apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uart.h
/****************************************************************************
 * arch/xtensa/src/esp32/hardware/esp32_uart.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_UART_H
#define __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_UART_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "hardware/esp32_soc.h"

/****************************************************************************
 * Pre-processor Macros
 ****************************************************************************/

#define REG_UART_BASE(i)                 (DR_REG_UART_BASE + (i) * 0x10000 + (i > 1 ? 0xe000 : 0))
#define AHB_FIFO_BASE(i)                 (AHB_REG_UART_BASE + (i) * 0x10000 + (i > 1 ? 0xe000 : 0))

#define UART_FIFO_OFFSET                 0x00
#define AHB_UART_FIFO_REG(i)             (AHB_FIFO_BASE(i) + UART_FIFO_OFFSET)
#define DR_UART_FIFO_REG(i)              (REG_UART_BASE(i) + UART_FIFO_OFFSET)

/* UART_RXFIFO_RD_BYTE : RO ;bitpos:[7:0] ;default: 8'b0 ; */

/* Description: This register stores one byte data read by rx fifo. */

#define UART_RXFIFO_RD_BYTE              0x000000FF
#define UART_RXFIFO_RD_BYTE_M            ((UART_RXFIFO_RD_BYTE_V) << (UART_RXFIFO_RD_BYTE_S))
#define UART_RXFIFO_RD_BYTE_V            0xFF
#define UART_RXFIFO_RD_BYTE_S            0

#define UART_INT_RAW_OFFSET              0x04
#define UART_INT_RAW_REG(i)              (REG_UART_BASE(i) + UART_INT_RAW_OFFSET)

/* UART_AT_CMD_CHAR_DET_INT_RAW : RO ;bitpos:[18] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when receiver
 * detects the configured at_cmd chars.
 */

#define UART_AT_CMD_CHAR_DET_INT_RAW     (BIT(18))
#define UART_AT_CMD_CHAR_DET_INT_RAW_M   (BIT(18))
#define UART_AT_CMD_CHAR_DET_INT_RAW_V   0x1
#define UART_AT_CMD_CHAR_DET_INT_RAW_S   18

/* UART_RS485_CLASH_INT_RAW : RO ;bitpos:[17] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when rs485 detects
 * the clash between transmitter and receiver.
 */

#define UART_RS485_CLASH_INT_RAW        (BIT(17))
#define UART_RS485_CLASH_INT_RAW_M      (BIT(17))
#define UART_RS485_CLASH_INT_RAW_V      0x1
#define UART_RS485_CLASH_INT_RAW_S      17

/* UART_RS485_FRM_ERR_INT_RAW : RO ;bitpos:[16] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when rs485 detects
 * the data frame error.
 */

#define UART_RS485_FRM_ERR_INT_RAW      (BIT(16))
#define UART_RS485_FRM_ERR_INT_RAW_M    (BIT(16))
#define UART_RS485_FRM_ERR_INT_RAW_V    0x1
#define UART_RS485_FRM_ERR_INT_RAW_S    16

/* UART_RS485_PARITY_ERR_INT_RAW : RO ;bitpos:[15] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when rs485
 * detects the parity error.
 */

#define UART_RS485_PARITY_ERR_INT_RAW   (BIT(15))
#define UART_RS485_PARITY_ERR_INT_RAW_M (BIT(15))
#define UART_RS485_PARITY_ERR_INT_RAW_V 0x1
#define UART_RS485_PARITY_ERR_INT_RAW_S 15

/* UART_TX_DONE_INT_RAW : RO ;bitpos:[14] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when transmitter
 * has send all the data in fifo.
 */

#define UART_TX_DONE_INT_RAW            (BIT(14))
#define UART_TX_DONE_INT_RAW_M          (BIT(14))
#define UART_TX_DONE_INT_RAW_V          0x1
#define UART_TX_DONE_INT_RAW_S          14

/* UART_TX_BRK_IDLE_DONE_INT_RAW : RO ;bitpos:[13] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when transmitter
 * has kept the shortest duration after the  last data has been send.
 */

#define UART_TX_BRK_IDLE_DONE_INT_RAW   (BIT(13))
#define UART_TX_BRK_IDLE_DONE_INT_RAW_M (BIT(13))
#define UART_TX_BRK_IDLE_DONE_INT_RAW_V 0x1
#define UART_TX_BRK_IDLE_DONE_INT_RAW_S 13

/* UART_TX_BRK_DONE_INT_RAW : RO ;bitpos:[12] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when transmitter
 * completes sending  0 after all the data in transmitter's fifo are send.
 */

#define UART_TX_BRK_DONE_INT_RAW        (BIT(12))
#define UART_TX_BRK_DONE_INT_RAW_M      (BIT(12))
#define UART_TX_BRK_DONE_INT_RAW_V      0x1
#define UART_TX_BRK_DONE_INT_RAW_S      12

/* UART_GLITCH_DET_INT_RAW : RO ;bitpos:[11] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when receiver
 * detects the start bit.
 */

#define UART_GLITCH_DET_INT_RAW         (BIT(11))
#define UART_GLITCH_DET_INT_RAW_M       (BIT(11))
#define UART_GLITCH_DET_INT_RAW_V       0x1
#define UART_GLITCH_DET_INT_RAW_S       11

/* UART_SW_XOFF_INT_RAW : RO ;bitpos:[10] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when receiver
 * receives xon char with uart_sw_flow_con_en is set to 1.
 */

#define UART_SW_XOFF_INT_RAW            (BIT(10))
#define UART_SW_XOFF_INT_RAW_M          (BIT(10))
#define UART_SW_XOFF_INT_RAW_V          0x1
#define UART_SW_XOFF_INT_RAW_S          10

/* UART_SW_XON_INT_RAW : RO ;bitpos:[9] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when receiver
 * receives xoff char with uart_sw_flow_con_en is set to 1.
 */

#define UART_SW_XON_INT_RAW             (BIT(9))
#define UART_SW_XON_INT_RAW_M           (BIT(9))
#define UART_SW_XON_INT_RAW_V           0x1
#define UART_SW_XON_INT_RAW_S           9

/* UART_RXFIFO_TOUT_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when receiver
 * takes more time than rx_tout_thrhd to receive a byte.
 */

