apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uart.h
#define UART_RXFIFO_TOUT_INT_RAW        (BIT(8))
#define UART_RXFIFO_TOUT_INT_RAW_M      (BIT(8))
#define UART_RXFIFO_TOUT_INT_RAW_V      0x1
#define UART_RXFIFO_TOUT_INT_RAW_S      8

/* UART_BRK_DET_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when receiver
 * detects the 0 after the stop bit.
 */

#define UART_BRK_DET_INT_RAW            (BIT(7))
#define UART_BRK_DET_INT_RAW_M          (BIT(7))
#define UART_BRK_DET_INT_RAW_V          0x1
#define UART_BRK_DET_INT_RAW_S          7

/* UART_CTS_CHG_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when receiver
 * detects the edge change of ctsn signal.
 */

#define UART_CTS_CHG_INT_RAW            (BIT(6))
#define UART_CTS_CHG_INT_RAW_M          (BIT(6))
#define UART_CTS_CHG_INT_RAW_V          0x1
#define UART_CTS_CHG_INT_RAW_S          6

/* UART_DSR_CHG_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when receiver
 * detects the edge change of dsrn signal.
 */

#define UART_DSR_CHG_INT_RAW            (BIT(5))
#define UART_DSR_CHG_INT_RAW_M          (BIT(5))
#define UART_DSR_CHG_INT_RAW_V          0x1
#define UART_DSR_CHG_INT_RAW_S          5

/* UART_RXFIFO_OVF_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when receiver
 * receives more data than the fifo can store.
 */

#define UART_RXFIFO_OVF_INT_RAW         (BIT(4))
#define UART_RXFIFO_OVF_INT_RAW_M       (BIT(4))
#define UART_RXFIFO_OVF_INT_RAW_V       0x1
#define UART_RXFIFO_OVF_INT_RAW_S       4

/* UART_FRM_ERR_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when receiver
 * detects data's frame error.
 */

#define UART_FRM_ERR_INT_RAW            (BIT(3))
#define UART_FRM_ERR_INT_RAW_M          (BIT(3))
#define UART_FRM_ERR_INT_RAW_V          0x1
#define UART_FRM_ERR_INT_RAW_S          3

/* UART_PARITY_ERR_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when receiver
 * detects the parity error of data.
 */

#define UART_PARITY_ERR_INT_RAW         (BIT(2))
#define UART_PARITY_ERR_INT_RAW_M       (BIT(2))
#define UART_PARITY_ERR_INT_RAW_V       0x1
#define UART_PARITY_ERR_INT_RAW_S       2

/* UART_TXFIFO_EMPTY_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when the amount
 * of data in transmitter's fifo is less than ((tx_mem_cnttxfifo_cnt).
 */

#define UART_TXFIFO_EMPTY_INT_RAW       (BIT(1))
#define UART_TXFIFO_EMPTY_INT_RAW_M     (BIT(1))
#define UART_TXFIFO_EMPTY_INT_RAW_V     0x1
#define UART_TXFIFO_EMPTY_INT_RAW_S     1

/* UART_RXFIFO_FULL_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */

/* Description: This interrupt raw bit turns to high level when receiver
 * receives more data than (rx_flow_thrhd_h3 rx_flow_thrhd).
 */

#define UART_RXFIFO_FULL_INT_RAW        (BIT(0))
#define UART_RXFIFO_FULL_INT_RAW_M      (BIT(0))
#define UART_RXFIFO_FULL_INT_RAW_V      0x1
#define UART_RXFIFO_FULL_INT_RAW_S      0

#define UART_INT_ST_OFFSET              0x08
#define UART_INT_ST_REG(i)              (REG_UART_BASE(i) + UART_INT_ST_OFFSET)

/* UART_AT_CMD_CHAR_DET_INT_ST : RO ;bitpos:[18] ;default: 1'b0 ; */

/* Description: This is the status bit for at_cmd_det_int_raw when
 * at_cmd_char_det_int_ena is set to 1.
 */

#define UART_AT_CMD_CHAR_DET_INT_ST     (BIT(18))
#define UART_AT_CMD_CHAR_DET_INT_ST_M   (BIT(18))
#define UART_AT_CMD_CHAR_DET_INT_ST_V   0x1
#define UART_AT_CMD_CHAR_DET_INT_ST_S   18

/* UART_RS485_CLASH_INT_ST : RO ;bitpos:[17] ;default: 1'b0 ; */

/* Description: This is the status bit for rs485_clash_int_raw when
 * rs485_clash_int_ena is set to 1.
 */

#define UART_RS485_CLASH_INT_ST         (BIT(17))
#define UART_RS485_CLASH_INT_ST_M       (BIT(17))
#define UART_RS485_CLASH_INT_ST_V       0x1
#define UART_RS485_CLASH_INT_ST_S       17

/* UART_RS485_FRM_ERR_INT_ST : RO ;bitpos:[16] ;default: 1'b0 ; */

/* Description: This is the status bit for rs485_fm_err_int_raw when
 * rs485_fm_err_int_ena is set to 1.
 */

#define UART_RS485_FRM_ERR_INT_ST       (BIT(16))
#define UART_RS485_FRM_ERR_INT_ST_M     (BIT(16))
#define UART_RS485_FRM_ERR_INT_ST_V     0x1
#define UART_RS485_FRM_ERR_INT_ST_S     16

/* UART_RS485_PARITY_ERR_INT_ST : RO ;bitpos:[15] ;default: 1'b0 ; */

/* Description: This is the status bit for rs485_parity_err_int_raw when
 * rs485_parity_int_ena is set to 1.
 */

#define UART_RS485_PARITY_ERR_INT_ST    (BIT(15))
#define UART_RS485_PARITY_ERR_INT_ST_M  (BIT(15))
#define UART_RS485_PARITY_ERR_INT_ST_V  0x1
#define UART_RS485_PARITY_ERR_INT_ST_S  15

/* UART_TX_DONE_INT_ST : RO ;bitpos:[14] ;default: 1'b0 ; */

/* Description: This is the status bit for tx_done_int_raw when
 * tx_done_int_ena is set to 1.
 */

#define UART_TX_DONE_INT_ST             (BIT(14))
#define UART_TX_DONE_INT_ST_M           (BIT(14))
#define UART_TX_DONE_INT_ST_V           0x1
#define UART_TX_DONE_INT_ST_S           14

/* UART_TX_BRK_IDLE_DONE_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */

/* Description: This is the stauts bit for tx_brk_idle_done_int_raw when
 * tx_brk_idle_done_int_ena is set to 1.
 */

#define UART_TX_BRK_IDLE_DONE_INT_ST    (BIT(13))
#define UART_TX_BRK_IDLE_DONE_INT_ST_M  (BIT(13))
#define UART_TX_BRK_IDLE_DONE_INT_ST_V  0x1
#define UART_TX_BRK_IDLE_DONE_INT_ST_S  13

/* UART_TX_BRK_DONE_INT_ST : RO ;bitpos:[12] ;default: 1'b0 ; */

/* Description: This is the status bit for tx_brk_done_int_raw when
 * tx_brk_done_int_ena is set to 1.
 */

#define UART_TX_BRK_DONE_INT_ST         (BIT(12))
#define UART_TX_BRK_DONE_INT_ST_M       (BIT(12))
#define UART_TX_BRK_DONE_INT_ST_V       0x1
#define UART_TX_BRK_DONE_INT_ST_S       12

/* UART_GLITCH_DET_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */

/* Description: This is the status bit for glitch_det_int_raw when
 * glitch_det_int_ena is set to 1.
 */

#define UART_GLITCH_DET_INT_ST          (BIT(11))
#define UART_GLITCH_DET_INT_ST_M        (BIT(11))
#define UART_GLITCH_DET_INT_ST_V        0x1
#define UART_GLITCH_DET_INT_ST_S        11

/* UART_SW_XOFF_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */

/* Description: This is the status bit for sw_xoff_int_raw when
 * sw_xoff_int_ena is set to 1.
 */

#define UART_SW_XOFF_INT_ST             (BIT(10))
#define UART_SW_XOFF_INT_ST_M           (BIT(10))
#define UART_SW_XOFF_INT_ST_V           0x1
#define UART_SW_XOFF_INT_ST_S           10

/* UART_SW_XON_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */

/* Description: This is the status bit for sw_xon_int_raw when
 * sw_xon_int_ena is set to 1.
 */

