apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uart.h
#define UART_SW_XON_INT_ST              (BIT(9))
#define UART_SW_XON_INT_ST_M            (BIT(9))
#define UART_SW_XON_INT_ST_V            0x1
#define UART_SW_XON_INT_ST_S            9

/* UART_RXFIFO_TOUT_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */

/* Description: This is the status bit for rxfifo_tout_int_raw when
 * rxfifo_tout_int_ena is set to 1.
 */

#define UART_RXFIFO_TOUT_INT_ST         (BIT(8))
#define UART_RXFIFO_TOUT_INT_ST_M       (BIT(8))
#define UART_RXFIFO_TOUT_INT_ST_V       0x1
#define UART_RXFIFO_TOUT_INT_ST_S       8

/* UART_BRK_DET_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */

/* Description: This is the status bit for brk_det_int_raw when
 * brk_det_int_ena is set to 1.
 */

#define UART_BRK_DET_INT_ST             (BIT(7))
#define UART_BRK_DET_INT_ST_M           (BIT(7))
#define UART_BRK_DET_INT_ST_V           0x1
#define UART_BRK_DET_INT_ST_S           7

/* UART_CTS_CHG_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */

/* Description: This is the status bit for cts_chg_int_raw when
 * cts_chg_int_ena is set to 1.
 */

#define UART_CTS_CHG_INT_ST             (BIT(6))
#define UART_CTS_CHG_INT_ST_M           (BIT(6))
#define UART_CTS_CHG_INT_ST_V           0x1
#define UART_CTS_CHG_INT_ST_S           6

/* UART_DSR_CHG_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */

/* Description: This is the status bit for dsr_chg_int_raw when
 * dsr_chg_int_ena is set to 1.
 */

#define UART_DSR_CHG_INT_ST             (BIT(5))
#define UART_DSR_CHG_INT_ST_M           (BIT(5))
#define UART_DSR_CHG_INT_ST_V           0x1
#define UART_DSR_CHG_INT_ST_S           5

/* UART_RXFIFO_OVF_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */

/* Description: This is the status bit for rxfifo_ovf_int_raw when
 * rxfifo_ovf_int_ena is set to 1.
 */

#define UART_RXFIFO_OVF_INT_ST          (BIT(4))
#define UART_RXFIFO_OVF_INT_ST_M        (BIT(4))
#define UART_RXFIFO_OVF_INT_ST_V        0x1
#define UART_RXFIFO_OVF_INT_ST_S        4

/* UART_FRM_ERR_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */

/* Description: This is the status bit for frm_err_int_raw when
 * fm_err_int_ena is set to 1.
 */

#define UART_FRM_ERR_INT_ST             (BIT(3))
#define UART_FRM_ERR_INT_ST_M           (BIT(3))
#define UART_FRM_ERR_INT_ST_V           0x1
#define UART_FRM_ERR_INT_ST_S           3

/* UART_PARITY_ERR_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */

/* Description: This is the status bit for parity_err_int_raw when
 * parity_err_int_ena is set to 1.
 */

#define UART_PARITY_ERR_INT_ST          (BIT(2))
#define UART_PARITY_ERR_INT_ST_M        (BIT(2))
#define UART_PARITY_ERR_INT_ST_V        0x1
#define UART_PARITY_ERR_INT_ST_S        2

/* UART_TXFIFO_EMPTY_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */

/* Description: This is the status bit for txfifo_empty_int_raw when
 * txfifo_empty_int_ena is set to 1.
 */

#define UART_TXFIFO_EMPTY_INT_ST        (BIT(1))
#define UART_TXFIFO_EMPTY_INT_ST_M      (BIT(1))
#define UART_TXFIFO_EMPTY_INT_ST_V      0x1
#define UART_TXFIFO_EMPTY_INT_ST_S      1

/* UART_RXFIFO_FULL_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */

/* Description: This is the status bit for rxfifo_full_int_raw when
 * rxfifo_full_int_ena is set to 1.
 */

#define UART_RXFIFO_FULL_INT_ST         (BIT(0))
#define UART_RXFIFO_FULL_INT_ST_M       (BIT(0))
#define UART_RXFIFO_FULL_INT_ST_V       0x1
#define UART_RXFIFO_FULL_INT_ST_S       0

#define UART_INT_ENA_OFFSET             0x0c
#define UART_INT_ENA_REG(i)             (REG_UART_BASE(i) + UART_INT_ENA_OFFSET)

/* UART_AT_CMD_CHAR_DET_INT_ENA : R/W ;bitpos:[18] ;default: 1'b0 ; */

/* Description: This is the enable bit for at_cmd_char_det_int_st register. */

#define UART_AT_CMD_CHAR_DET_INT_ENA    (BIT(18))
#define UART_AT_CMD_CHAR_DET_INT_ENA_M  (BIT(18))
#define UART_AT_CMD_CHAR_DET_INT_ENA_V  0x1
#define UART_AT_CMD_CHAR_DET_INT_ENA_S  18

/* UART_RS485_CLASH_INT_ENA : R/W ;bitpos:[17] ;default: 1'b0 ; */

/* Description: This is the enable bit for rs485_clash_int_st register. */

#define UART_RS485_CLASH_INT_ENA        (BIT(17))
#define UART_RS485_CLASH_INT_ENA_M      (BIT(17))
#define UART_RS485_CLASH_INT_ENA_V      0x1
#define UART_RS485_CLASH_INT_ENA_S      17

/* UART_RS485_FRM_ERR_INT_ENA : R/W ;bitpos:[16] ;default: 1'b0 ; */

/* Description:
 * This is the enable bit for rs485_parity_err_int_st register.
 */

#define UART_RS485_FRM_ERR_INT_ENA      (BIT(16))
#define UART_RS485_FRM_ERR_INT_ENA_M    (BIT(16))
#define UART_RS485_FRM_ERR_INT_ENA_V    0x1
#define UART_RS485_FRM_ERR_INT_ENA_S    16

/* UART_RS485_PARITY_ERR_INT_ENA : R/W ;bitpos:[15] ;default: 1'b0 ; */

/* Description:
 * This is the enable bit for rs485_parity_err_int_st register.
 */

#define UART_RS485_PARITY_ERR_INT_ENA   (BIT(15))
#define UART_RS485_PARITY_ERR_INT_ENA_M (BIT(15))
#define UART_RS485_PARITY_ERR_INT_ENA_V 0x1
#define UART_RS485_PARITY_ERR_INT_ENA_S 15

/* UART_TX_DONE_INT_ENA : R/W ;bitpos:[14] ;default: 1'b0 ; */

/* Description: This is the enable bit for tx_done_int_st register. */

#define UART_TX_DONE_INT_ENA            (BIT(14))
#define UART_TX_DONE_INT_ENA_M          (BIT(14))
#define UART_TX_DONE_INT_ENA_V          0x1
#define UART_TX_DONE_INT_ENA_S          14

/* UART_TX_BRK_IDLE_DONE_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */

/* Description:
 * This is the enable bit for tx_brk_idle_done_int_st register.
 */

#define UART_TX_BRK_IDLE_DONE_INT_ENA   (BIT(13))
#define UART_TX_BRK_IDLE_DONE_INT_ENA_M (BIT(13))
#define UART_TX_BRK_IDLE_DONE_INT_ENA_V 0x1
#define UART_TX_BRK_IDLE_DONE_INT_ENA_S 13

/* UART_TX_BRK_DONE_INT_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */

/* Description: This is the enable bit for tx_brk_done_int_st register. */

#define UART_TX_BRK_DONE_INT_ENA        (BIT(12))
#define UART_TX_BRK_DONE_INT_ENA_M      (BIT(12))
#define UART_TX_BRK_DONE_INT_ENA_V      0x1
#define UART_TX_BRK_DONE_INT_ENA_S      12

/* UART_GLITCH_DET_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */

/* Description: This is the enable bit for glitch_det_int_st register. */

#define UART_GLITCH_DET_INT_ENA         (BIT(11))
#define UART_GLITCH_DET_INT_ENA_M       (BIT(11))
#define UART_GLITCH_DET_INT_ENA_V       0x1
#define UART_GLITCH_DET_INT_ENA_S       11

