apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uart.h
/* UART_SW_XOFF_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */

/* Description: This is the enable bit for sw_xoff_int_st register. */

#define UART_SW_XOFF_INT_ENA            (BIT(10))
#define UART_SW_XOFF_INT_ENA_M          (BIT(10))
#define UART_SW_XOFF_INT_ENA_V          0x1
#define UART_SW_XOFF_INT_ENA_S          10

/* UART_SW_XON_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */

/* Description: This is the enable bit for sw_xon_int_st register. */

#define UART_SW_XON_INT_ENA             (BIT(9))
#define UART_SW_XON_INT_ENA_M           (BIT(9))
#define UART_SW_XON_INT_ENA_V           0x1
#define UART_SW_XON_INT_ENA_S           9

/* UART_RXFIFO_TOUT_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */

/* Description: This is the enable bit for rxfifo_tout_int_st register. */

#define UART_RXFIFO_TOUT_INT_ENA        (BIT(8))
#define UART_RXFIFO_TOUT_INT_ENA_M      (BIT(8))
#define UART_RXFIFO_TOUT_INT_ENA_V      0x1
#define UART_RXFIFO_TOUT_INT_ENA_S      8

/* UART_BRK_DET_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */

/* Description: This is the enable bit for brk_det_int_st register. */

#define UART_BRK_DET_INT_ENA            (BIT(7))
#define UART_BRK_DET_INT_ENA_M          (BIT(7))
#define UART_BRK_DET_INT_ENA_V          0x1
#define UART_BRK_DET_INT_ENA_S          7

/* UART_CTS_CHG_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */

/* Description: This is the enable bit for cts_chg_int_st register. */

#define UART_CTS_CHG_INT_ENA            (BIT(6))
#define UART_CTS_CHG_INT_ENA_M          (BIT(6))
#define UART_CTS_CHG_INT_ENA_V          0x1
#define UART_CTS_CHG_INT_ENA_S          6

/* UART_DSR_CHG_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */

/* Description: This is the enable bit for dsr_chg_int_st register. */

#define UART_DSR_CHG_INT_ENA            (BIT(5))
#define UART_DSR_CHG_INT_ENA_M          (BIT(5))
#define UART_DSR_CHG_INT_ENA_V          0x1
#define UART_DSR_CHG_INT_ENA_S          5

/* UART_RXFIFO_OVF_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */

/* Description: This is the enable bit for rxfifo_ovf_int_st register. */

#define UART_RXFIFO_OVF_INT_ENA         (BIT(4))
#define UART_RXFIFO_OVF_INT_ENA_M       (BIT(4))
#define UART_RXFIFO_OVF_INT_ENA_V       0x1
#define UART_RXFIFO_OVF_INT_ENA_S       4

/* UART_FRM_ERR_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */

/* Description: This is the enable bit for frm_err_int_st register. */

#define UART_FRM_ERR_INT_ENA            (BIT(3))
#define UART_FRM_ERR_INT_ENA_M          (BIT(3))
#define UART_FRM_ERR_INT_ENA_V          0x1
#define UART_FRM_ERR_INT_ENA_S          3

/* UART_PARITY_ERR_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */

/* Description: This is the enable bit for parity_err_int_st register. */

#define UART_PARITY_ERR_INT_ENA         (BIT(2))
#define UART_PARITY_ERR_INT_ENA_M       (BIT(2))
#define UART_PARITY_ERR_INT_ENA_V       0x1
#define UART_PARITY_ERR_INT_ENA_S       2

/* UART_TXFIFO_EMPTY_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */

/* Description: This is the enable bit for txfifo_fifo_int_st register. */

#define UART_TXFIFO_EMPTY_INT_ENA       (BIT(1))
#define UART_TXFIFO_EMPTY_INT_ENA_M     (BIT(1))
#define UART_TXFIFO_EMPTY_INT_ENA_V     0x1
#define UART_TXFIFO_EMPTY_INT_ENA_S     1

/* UART_RXFIFO_FULL_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */

/* Description: This is the enable bit for rxfifo_full_int_st register. */

#define UART_RXFIFO_FULL_INT_ENA        (BIT(0))
#define UART_RXFIFO_FULL_INT_ENA_M      (BIT(0))
#define UART_RXFIFO_FULL_INT_ENA_V      0x1
#define UART_RXFIFO_FULL_INT_ENA_S      0

#define UART_INT_CLR_OFFSET             0x10
#define UART_INT_CLR_REG(i)             (REG_UART_BASE(i) + UART_INT_CLR_OFFSET)

/* UART_AT_CMD_CHAR_DET_INT_CLR : WO ;bitpos:[18] ;default: 1'b0 ; */

/* Description:
 * Set this bit to clear the at_cmd_char_det_int_raw interrupt.
 */

#define UART_AT_CMD_CHAR_DET_INT_CLR    (BIT(18))
#define UART_AT_CMD_CHAR_DET_INT_CLR_M  (BIT(18))
#define UART_AT_CMD_CHAR_DET_INT_CLR_V  0x1
#define UART_AT_CMD_CHAR_DET_INT_CLR_S  18

/* UART_RS485_CLASH_INT_CLR : WO ;bitpos:[17] ;default: 1'b0 ; */

/* Description: Set this bit to clear the rs485_clash_int_raw interrupt. */

#define UART_RS485_CLASH_INT_CLR        (BIT(17))
#define UART_RS485_CLASH_INT_CLR_M      (BIT(17))
#define UART_RS485_CLASH_INT_CLR_V      0x1
#define UART_RS485_CLASH_INT_CLR_S      17

/* UART_RS485_FRM_ERR_INT_CLR : WO ;bitpos:[16] ;default: 1'b0 ; */

/* Description: Set this bit to clear the rs485_frm_err_int_raw interrupt. */

#define UART_RS485_FRM_ERR_INT_CLR      (BIT(16))
#define UART_RS485_FRM_ERR_INT_CLR_M    (BIT(16))
#define UART_RS485_FRM_ERR_INT_CLR_V    0x1
#define UART_RS485_FRM_ERR_INT_CLR_S    16

/* UART_RS485_PARITY_ERR_INT_CLR : WO ;bitpos:[15] ;default: 1'b0 ; */

/* Description: Set this bit to clear the rs485_parity_err_int_raw
 * interrupt.
 */

#define UART_RS485_PARITY_ERR_INT_CLR   (BIT(15))
#define UART_RS485_PARITY_ERR_INT_CLR_M (BIT(15))
#define UART_RS485_PARITY_ERR_INT_CLR_V 0x1
#define UART_RS485_PARITY_ERR_INT_CLR_S 15

/* UART_TX_DONE_INT_CLR : WO ;bitpos:[14] ;default: 1'b0 ; */

/* Description: Set this bit to clear the tx_done_int_raw interrupt. */

#define UART_TX_DONE_INT_CLR            (BIT(14))
#define UART_TX_DONE_INT_CLR_M          (BIT(14))
#define UART_TX_DONE_INT_CLR_V          0x1
#define UART_TX_DONE_INT_CLR_S          14

/* UART_TX_BRK_IDLE_DONE_INT_CLR : WO ;bitpos:[13] ;default: 1'b0 ; */

/* Description: Set this bit to clear the tx_brk_idle_done_int_raw
 * interrupt.
 */

#define UART_TX_BRK_IDLE_DONE_INT_CLR   (BIT(13))
#define UART_TX_BRK_IDLE_DONE_INT_CLR_M (BIT(13))
#define UART_TX_BRK_IDLE_DONE_INT_CLR_V 0x1
#define UART_TX_BRK_IDLE_DONE_INT_CLR_S 13

/* UART_TX_BRK_DONE_INT_CLR : WO ;bitpos:[12] ;default: 1'b0 ; */

/* Description: Set this bit to clear the tx_brk_done_int_raw interrupt. */

#define UART_TX_BRK_DONE_INT_CLR        (BIT(12))
#define UART_TX_BRK_DONE_INT_CLR_M      (BIT(12))
#define UART_TX_BRK_DONE_INT_CLR_V      0x1
#define UART_TX_BRK_DONE_INT_CLR_S      12

/* UART_GLITCH_DET_INT_CLR : WO ;bitpos:[11] ;default: 1'b0 ; */

/* Description: Set this bit to clear the glitch_det_int_raw interrupt. */

#define UART_GLITCH_DET_INT_CLR         (BIT(11))
#define UART_GLITCH_DET_INT_CLR_M       (BIT(11))
#define UART_GLITCH_DET_INT_CLR_V       0x1
#define UART_GLITCH_DET_INT_CLR_S       11

/* UART_SW_XOFF_INT_CLR : WO ;bitpos:[10] ;default: 1'b0 ; */

/* Description: Set this bit to clear the sw_xon_int_raw interrupt. */

#define UART_SW_XOFF_INT_CLR            (BIT(10))
#define UART_SW_XOFF_INT_CLR_M          (BIT(10))
#define UART_SW_XOFF_INT_CLR_V          0x1
#define UART_SW_XOFF_INT_CLR_S          10

/* UART_SW_XON_INT_CLR : WO ;bitpos:[9] ;default: 1'b0 ; */

/* Description: Set this bit to clear the sw_xon_int_raw interrupt. */

#define UART_SW_XON_INT_CLR             (BIT(9))
#define UART_SW_XON_INT_CLR_M           (BIT(9))
#define UART_SW_XON_INT_CLR_V           0x1
#define UART_SW_XON_INT_CLR_S           9

/* UART_RXFIFO_TOUT_INT_CLR : WO ;bitpos:[8] ;default: 1'b0 ; */

/* Description: Set this bit to clear the rxfifo_tout_int_raw interrupt. */

#define UART_RXFIFO_TOUT_INT_CLR        (BIT(8))
#define UART_RXFIFO_TOUT_INT_CLR_M      (BIT(8))
#define UART_RXFIFO_TOUT_INT_CLR_V      0x1
#define UART_RXFIFO_TOUT_INT_CLR_S      8

/* UART_BRK_DET_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */

