apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uart.h
/* Description: Set this bit to clear the brk_det_int_raw interrupt. */

#define UART_BRK_DET_INT_CLR            (BIT(7))
#define UART_BRK_DET_INT_CLR_M          (BIT(7))
#define UART_BRK_DET_INT_CLR_V          0x1
#define UART_BRK_DET_INT_CLR_S          7

/* UART_CTS_CHG_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */

/* Description: Set this bit to clear the cts_chg_int_raw interrupt. */

#define UART_CTS_CHG_INT_CLR            (BIT(6))
#define UART_CTS_CHG_INT_CLR_M          (BIT(6))
#define UART_CTS_CHG_INT_CLR_V          0x1
#define UART_CTS_CHG_INT_CLR_S          6

/* UART_DSR_CHG_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */

/* Description: Set this bit to clear the dsr_chg_int_raw interrupt. */

#define UART_DSR_CHG_INT_CLR            (BIT(5))
#define UART_DSR_CHG_INT_CLR_M          (BIT(5))
#define UART_DSR_CHG_INT_CLR_V          0x1
#define UART_DSR_CHG_INT_CLR_S          5

/* UART_RXFIFO_OVF_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */

/* Description: Set this bit to clear rxfifo_ovf_int_raw interrupt. */

#define UART_RXFIFO_OVF_INT_CLR         (BIT(4))
#define UART_RXFIFO_OVF_INT_CLR_M       (BIT(4))
#define UART_RXFIFO_OVF_INT_CLR_V       0x1
#define UART_RXFIFO_OVF_INT_CLR_S       4

/* UART_FRM_ERR_INT_CLR : WO ;bitpos:[3] ;default: 1'b0 ; */

/* Description: Set this bit to clear frm_err_int_raw interrupt. */

#define UART_FRM_ERR_INT_CLR            (BIT(3))
#define UART_FRM_ERR_INT_CLR_M          (BIT(3))
#define UART_FRM_ERR_INT_CLR_V          0x1
#define UART_FRM_ERR_INT_CLR_S          3

/* UART_PARITY_ERR_INT_CLR : WO ;bitpos:[2] ;default: 1'b0 ; */

/* Description: Set this bit to clear parity_err_int_raw interrupt. */

#define UART_PARITY_ERR_INT_CLR         (BIT(2))
#define UART_PARITY_ERR_INT_CLR_M       (BIT(2))
#define UART_PARITY_ERR_INT_CLR_V       0x1
#define UART_PARITY_ERR_INT_CLR_S       2

/* UART_TXFIFO_EMPTY_INT_CLR : WO ;bitpos:[1] ;default: 1'b0 ; */

/* Description: Set this bit to clear txfifo_empty_int_raw interrupt. */

#define UART_TXFIFO_EMPTY_INT_CLR       (BIT(1))
#define UART_TXFIFO_EMPTY_INT_CLR_M     (BIT(1))
#define UART_TXFIFO_EMPTY_INT_CLR_V     0x1
#define UART_TXFIFO_EMPTY_INT_CLR_S     1

/* UART_RXFIFO_FULL_INT_CLR : WO ;bitpos:[0] ;default: 1'b0 ; */

/* Description: Set this bit to clear the rxfifo_full_int_raw interrupt. */

#define UART_RXFIFO_FULL_INT_CLR        (BIT(0))
#define UART_RXFIFO_FULL_INT_CLR_M      (BIT(0))
#define UART_RXFIFO_FULL_INT_CLR_V      0x1
#define UART_RXFIFO_FULL_INT_CLR_S      0

#define UART_CLKDIV_OFFSET              0x14
#define UART_CLKDIV_REG(i)              (REG_UART_BASE(i) + UART_CLKDIV_OFFSET)

/* UART_CLKDIV_FRAG : R/W ;bitpos:[23:20] ;default: 4'h0 ; */

/* Description: The register  value is the decimal part of the frequency
 * divider's factor.
 */

#define UART_CLKDIV_FRAG                0x0000000F
#define UART_CLKDIV_FRAG_M              ((UART_CLKDIV_FRAG_V) << (UART_CLKDIV_FRAG_S))
#define UART_CLKDIV_FRAG_V              0xF
#define UART_CLKDIV_FRAG_S              20

/* UART_CLKDIV : R/W ;bitpos:[19:0] ;default: 20'h2B6 ; */

/* Description: The register value is  the  integer part of the frequency
 * divider's factor.
 */

#define UART_CLKDIV                     0x000FFFFF
#define UART_CLKDIV_M                   ((UART_CLKDIV_V) << (UART_CLKDIV_S))
#define UART_CLKDIV_V                   0xFFFFF
#define UART_CLKDIV_S                   0

#define UART_AUTOBAUD_OFFSET            0x18
#define UART_AUTOBAUD_REG(i)            (REG_UART_BASE(i) + UART_AUTOBAUD_OFFSET)

/* UART_GLITCH_FILT : R/W ;bitpos:[15:8] ;default: 8'h10 ; */

/* Description: when input pulse width is lower then this value ignore this
 * pulse.  This register is used in autobaud detect process.
 */

#define UART_GLITCH_FILT                0x000000FF
#define UART_GLITCH_FILT_M              ((UART_GLITCH_FILT_V) << (UART_GLITCH_FILT_S))
#define UART_GLITCH_FILT_V              0xFF
#define UART_GLITCH_FILT_S              8

/* UART_AUTOBAUD_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */

/* Description: This is the enable bit for detecting baudrate. */

#define UART_AUTOBAUD_EN                (BIT(0))
#define UART_AUTOBAUD_EN_M              (BIT(0))
#define UART_AUTOBAUD_EN_V              0x1
#define UART_AUTOBAUD_EN_S              0

#define UART_STATUS_OFFSET              0x1c
#define UART_STATUS_REG(i)              (REG_UART_BASE(i) + UART_STATUS_OFFSET)

/* UART_TXD : RO ;bitpos:[31] ;default: 8'h0 ; */

/* Description: This register represent the level value of the internal
 * uart rxd signal.
 */

#define UART_TXD                        (BIT(31))
#define UART_TXD_M                      (BIT(31))
#define UART_TXD_V                      0x1
#define UART_TXD_S                      31

/* UART_RTSN : RO ;bitpos:[30] ;default: 1'b0 ; */

/* Description: This register represent the level value of the internal uart
 * cts signal.
 */

#define UART_RTSN                       (BIT(30))
#define UART_RTSN_M                     (BIT(30))
#define UART_RTSN_V                     0x1
#define UART_RTSN_S                     30

/* UART_DTRN : RO ;bitpos:[29] ;default: 1'b0 ; */

/* Description: The register represent the level value of the internal uart
 * dsr signal.
 */

#define UART_DTRN                       (BIT(29))
#define UART_DTRN_M                     (BIT(29))
#define UART_DTRN_V                     0x1
#define UART_DTRN_S                     29

/* UART_ST_UTX_OUT : RO ;bitpos:[27:24] ;default: 4'b0 ; */

/* Description: This register stores the value of transmitter's finite state
 * machine. 0:TX_IDLE  1:TX_STRT  2:TX_DAT0  3:TX_DAT1  4:TX_DAT2
 * 5:TX_DAT3 6:TX_DAT4  7:TX_DAT5  8:TX_DAT6 9:TX_DAT7  10:TX_PRTY
 * 11:TX_STP1  12:TX_STP2  13:TX_DL0   14:TX_DL1
 */

#define UART_ST_UTX_OUT                 0x0000000F
#define UART_ST_UTX_OUT_M               ((UART_ST_UTX_OUT_V) << (UART_ST_UTX_OUT_S))
#define UART_ST_UTX_OUT_V               0xF
#define UART_ST_UTX_OUT_S               24

/* UART_TXFIFO_CNT : RO ;bitpos:[23:16] ;default: 8'b0 ; */

/* Description: (tx_mem_cnt txfifo_cnt) stores the byte num of valid data
 * in transmitter's fifo.  tx_mem_cnt stores the 3 most significant bits
 * txfifo_cnt stores the 8 least significant bits.
 */

#define UART_TXFIFO_CNT                 0x000000FF
#define UART_TXFIFO_CNT_M               ((UART_TXFIFO_CNT_V) << (UART_TXFIFO_CNT_S))
#define UART_TXFIFO_CNT_V               0xFF
#define UART_TXFIFO_CNT_S               16

/* UART_RXD : RO ;bitpos:[15] ;default: 1'b0 ; */

