apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uart.h
/* Description: This register stores the level value of the internal uart
 * rxd signal.
 */

#define UART_RXD                        (BIT(15))
#define UART_RXD_M                      (BIT(15))
#define UART_RXD_V                      0x1
#define UART_RXD_S                      15

/* UART_CTSN : RO ;bitpos:[14] ;default: 1'b0 ; */

/* Description: This register stores the level value of the internal uart
 * cts signal.
 */

#define UART_CTSN                       (BIT(14))
#define UART_CTSN_M                     (BIT(14))
#define UART_CTSN_V                     0x1
#define UART_CTSN_S                     14

/* UART_DSRN : RO ;bitpos:[13] ;default: 1'b0 ; */

/* Description: This register stores the level value of the internal uart
 * dsr signal.
 */

#define UART_DSRN                       (BIT(13))
#define UART_DSRN_M                     (BIT(13))
#define UART_DSRN_V                     0x1
#define UART_DSRN_S                     13

/* UART_ST_URX_OUT : RO ;bitpos:[11:8] ;default: 4'b0 ; */

/* Description: This register stores the value of receiver's finite state
 * machine.
 * 0:RX_IDLE  1:RX_STRT  2:RX_DAT0  3:RX_DAT1  4:RX_DAT2  5:RX_DAT3
 * 6:RX_DAT4  7:RX_DAT5  8:RX_DAT6  9:RX_DAT7   10:RX_PRTY   11:RX_STP1
 * 12:RX_STP2 13:RX_DL1
 */

#define UART_ST_URX_OUT                 0x0000000F
#define UART_ST_URX_OUT_M               ((UART_ST_URX_OUT_V) << (UART_ST_URX_OUT_S))
#define UART_ST_URX_OUT_V               0xF
#define UART_ST_URX_OUT_S               8

/* UART_RXFIFO_CNT : RO ;bitpos:[7:0] ;default: 8'b0 ; */

/* Description: (rx_mem_cnt rxfifo_cnt) stores the byte num of valid data
 * in receiver's fifo. rx_mem_cnt register stores the 3 most significant
 * bits rxfifo_cnt stores the 8 least significant bits.
 */

#define UART_RXFIFO_CNT                 0x000000FF
#define UART_RXFIFO_CNT_M               ((UART_RXFIFO_CNT_V) << (UART_RXFIFO_CNT_S))
#define UART_RXFIFO_CNT_V               0xFF
#define UART_RXFIFO_CNT_S               0

#define UART_CONF0_OFFSET               0x20
#define UART_CONF0_REG(i)               (REG_UART_BASE(i) + UART_CONF0_OFFSET)

/* UART_TICK_REF_ALWAYS_ON : R/W ;bitpos:[27] ;default: 1'b1 ; */

/* Description: This register is used to select the clock.1.apb clock
 * 0:ref_tick
 */

#define UART_TICK_REF_ALWAYS_ON         (BIT(27))
#define UART_TICK_REF_ALWAYS_ON_M       (BIT(27))
#define UART_TICK_REF_ALWAYS_ON_V       0x1
#define UART_TICK_REF_ALWAYS_ON_S       27

/* UART_ERR_WR_MASK : R/W ;bitpos:[26] ;default: 1'b0 ; */

/* Description: 1.receiver stops storing data int fifo when data is wrong.
 * 0.receiver stores the data even if the  received data is wrong.
 */

#define UART_ERR_WR_MASK                (BIT(26))
#define UART_ERR_WR_MASK_M              (BIT(26))
#define UART_ERR_WR_MASK_V              0x1
#define UART_ERR_WR_MASK_S              26

/* UART_CLK_EN : R/W ;bitpos:[25] ;default: 1'h0 ; */

/* Description: 1.force clock on for registers.support clock only when write
 * registers
 */

#define UART_CLK_EN                     (BIT(25))
#define UART_CLK_EN_M                   (BIT(25))
#define UART_CLK_EN_V                   0x1
#define UART_CLK_EN_S                   25

/* UART_DTR_INV : R/W ;bitpos:[24] ;default: 1'h0 ; */

/* Description: Set this bit to inverse the level value of uart dtr signal. */

#define UART_DTR_INV                    (BIT(24))
#define UART_DTR_INV_M                  (BIT(24))
#define UART_DTR_INV_V                  0x1
#define UART_DTR_INV_S                  24

/* UART_RTS_INV : R/W ;bitpos:[23] ;default: 1'h0 ; */

/* Description: Set this bit to inverse the level value of uart rts signal. */

#define UART_RTS_INV                    (BIT(23))
#define UART_RTS_INV_M                  (BIT(23))
#define UART_RTS_INV_V                  0x1
#define UART_RTS_INV_S                  23

/* UART_TXD_INV : R/W ;bitpos:[22] ;default: 1'h0 ; */

/* Description: Set this bit to inverse the level value of uart txd signal. */

#define UART_TXD_INV                    (BIT(22))
#define UART_TXD_INV_M                  (BIT(22))
#define UART_TXD_INV_V                  0x1
#define UART_TXD_INV_S                  22

/* UART_DSR_INV : R/W ;bitpos:[21] ;default: 1'h0 ; */

/* Description: Set this bit to inverse the level value of uart dsr signal. */

#define UART_DSR_INV                    (BIT(21))
#define UART_DSR_INV_M                  (BIT(21))
#define UART_DSR_INV_V                  0x1
#define UART_DSR_INV_S                  21

/* UART_CTS_INV : R/W ;bitpos:[20] ;default: 1'h0 ; */

/* Description: Set this bit to inverse the level value of uart cts signal. */

#define UART_CTS_INV                    (BIT(20))
#define UART_CTS_INV_M                  (BIT(20))
#define UART_CTS_INV_V                  0x1
#define UART_CTS_INV_S                  20

/* UART_RXD_INV : R/W ;bitpos:[19] ;default: 1'h0 ; */

/* Description: Set this bit to inverse the level value of uart rxd signal. */

#define UART_RXD_INV                    (BIT(19))
#define UART_RXD_INV_M                  (BIT(19))
#define UART_RXD_INV_V                  0x1
#define UART_RXD_INV_S                  19

/* UART_TXFIFO_RST : R/W ;bitpos:[18] ;default: 1'h0 ; */

/* Description: Set this bit to reset uart transmitter's fifo. */

#define UART_TXFIFO_RST                 (BIT(18))
#define UART_TXFIFO_RST_M               (BIT(18))
#define UART_TXFIFO_RST_V               0x1
#define UART_TXFIFO_RST_S               18

/* UART_RXFIFO_RST : R/W ;bitpos:[17] ;default: 1'h0 ; */

/* Description: Set this bit to reset uart receiver's fifo. */

#define UART_RXFIFO_RST                 (BIT(17))
#define UART_RXFIFO_RST_M               (BIT(17))
#define UART_RXFIFO_RST_V               0x1
#define UART_RXFIFO_RST_S               17

/* UART_IRDA_EN : R/W ;bitpos:[16] ;default: 1'h0 ; */

/* Description: Set this bit to enable irda protocol. */

#define UART_IRDA_EN                    (BIT(16))
#define UART_IRDA_EN_M                  (BIT(16))
#define UART_IRDA_EN_V                  0x1
#define UART_IRDA_EN_S                  16

/* UART_TX_FLOW_EN : R/W ;bitpos:[15] ;default: 1'b0 ; */

/* Description: Set this bit to enable transmitter's flow control function. */

#define UART_TX_FLOW_EN                 (BIT(15))
#define UART_TX_FLOW_EN_M               (BIT(15))
#define UART_TX_FLOW_EN_V               0x1
#define UART_TX_FLOW_EN_S               15

/* UART_LOOPBACK : R/W ;bitpos:[14] ;default: 1'b0 ; */

/* Description: Set this bit to enable uart loopback test mode. */

#define UART_LOOPBACK                   (BIT(14))
#define UART_LOOPBACK_M                 (BIT(14))
#define UART_LOOPBACK_V                 0x1
#define UART_LOOPBACK_S                 14

