apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uart.h
/* UART_IRDA_RX_INV : R/W ;bitpos:[13] ;default: 1'b0 ; */

/* Description: Set this bit to inverse the level value of irda receiver's
 * level.
 */

#define UART_IRDA_RX_INV                (BIT(13))
#define UART_IRDA_RX_INV_M              (BIT(13))
#define UART_IRDA_RX_INV_V              0x1
#define UART_IRDA_RX_INV_S              13

/* UART_IRDA_TX_INV : R/W ;bitpos:[12] ;default: 1'b0 ; */

/* Description: Set this bit to inverse the level value of irda
 * transmitter's level.
 */

#define UART_IRDA_TX_INV                (BIT(12))
#define UART_IRDA_TX_INV_M              (BIT(12))
#define UART_IRDA_TX_INV_V              0x1
#define UART_IRDA_TX_INV_S              12

/* UART_IRDA_WCTL : R/W ;bitpos:[11] ;default: 1'b0 ; */

/* Description: 1.the irda transmitter's 11th bit is the same to the 10th
 * bit. 0.set irda transmitter's 11th bit to 0.
 */

#define UART_IRDA_WCTL                  (BIT(11))
#define UART_IRDA_WCTL_M                (BIT(11))
#define UART_IRDA_WCTL_V                0x1
#define UART_IRDA_WCTL_S                11

/* UART_IRDA_TX_EN : R/W ;bitpos:[10] ;default: 1'b0 ; */

/* Description: This is the start enable bit for irda transmitter. */

#define UART_IRDA_TX_EN                 (BIT(10))
#define UART_IRDA_TX_EN_M               (BIT(10))
#define UART_IRDA_TX_EN_V               0x1
#define UART_IRDA_TX_EN_S               10

/* UART_IRDA_DPLX : R/W ;bitpos:[9] ;default: 1'b0 ; */

/* Description: Set this bit to enable irda loopback mode. */

#define UART_IRDA_DPLX                  (BIT(9))
#define UART_IRDA_DPLX_M                (BIT(9))
#define UART_IRDA_DPLX_V                0x1
#define UART_IRDA_DPLX_S                9

/* UART_TXD_BRK : R/W ;bitpos:[8] ;default: 1'b0 ; */

/* Description: Set this bit to enable transmitter to  send 0 when the
 * process of sending data is done.
 */

#define UART_TXD_BRK                    (BIT(8))
#define UART_TXD_BRK_M                  (BIT(8))
#define UART_TXD_BRK_V                  0x1
#define UART_TXD_BRK_S                  8

/* UART_SW_DTR : R/W ;bitpos:[7] ;default: 1'b0 ; */

/* Description: This register is used to configure the software dtr signal
 * which is used in software flow control.
 */

#define UART_SW_DTR                     (BIT(7))
#define UART_SW_DTR_M                   (BIT(7))
#define UART_SW_DTR_V                   0x1
#define UART_SW_DTR_S                   7

/* UART_SW_RTS : R/W ;bitpos:[6] ;default: 1'b0 ; */

/* Description: This register is used to configure the software rts signal
 * which is used in software flow control.
 */

#define UART_SW_RTS                     (BIT(6))
#define UART_SW_RTS_M                   (BIT(6))
#define UART_SW_RTS_V                   0x1
#define UART_SW_RTS_S                   6

/* UART_STOP_BIT_NUM : R/W ;bitpos:[5:4] ;default: 2'd1 ; */

/* Description: This register is used to set the length of stop bit.
 * 1:1bit  2:1.5bits  3:2bits
 */

#define UART_STOP_BIT_NUM               0x00000003
#define UART_STOP_BIT_NUM_M             ((UART_STOP_BIT_NUM_V) << (UART_STOP_BIT_NUM_S))
#define UART_STOP_BIT_NUM_V             0x3
#define UART_STOP_BIT_NUM_S             4

/* UART_BIT_NUM : R/W ;bitpos:[3:2] ;default: 2'd3 ; */

/* Description: This register is used to set the length of data:
 * 0:5bits 1:6bits 2:7bits 3:8bits
 */

#define UART_BIT_NUM                    0x00000003
#define UART_BIT_NUM_M                  ((UART_BIT_NUM_V) << (UART_BIT_NUM_S))
#define UART_BIT_NUM_V                  0x3
#define UART_BIT_NUM_S                  2

/* UART_PARITY_EN : R/W ;bitpos:[1] ;default: 1'b0 ; */

/* Description: Set this bit to enable uart parity check. */

#define UART_PARITY_EN                  (BIT(1))
#define UART_PARITY_EN_M                (BIT(1))
#define UART_PARITY_EN_V                0x1
#define UART_PARITY_EN_S                1

/* UART_PARITY : R/W ;bitpos:[0] ;default: 1'b0 ; */

/* Description: This register is used to configure the parity check mode.
 * 0:even 1:odd
 */

#define UART_PARITY                     (BIT(0))
#define UART_PARITY_M                   (BIT(0))
#define UART_PARITY_V                   0x1
#define UART_PARITY_S                   0

#define UART_CONF1_OFFSET               0x24
#define UART_CONF1_REG(i)               (REG_UART_BASE(i) + UART_CONF1_OFFSET)

/* UART_RX_TOUT_EN : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description:
 * This is the enable bit for uart receiver's timeout function.
 */

#define UART_RX_TOUT_EN                 (BIT(31))
#define UART_RX_TOUT_EN_M               (BIT(31))
#define UART_RX_TOUT_EN_V               0x1
#define UART_RX_TOUT_EN_S               31

/* UART_RX_TOUT_THRHD : R/W ;bitpos:[30:24] ;default: 7'b0 ; */

/* Description: This register is used to configure the timeout value for
 * uart receiver receiving a byte.
 */

#define UART_RX_TOUT_THRHD              0x0000007F
#define UART_RX_TOUT_THRHD_M            ((UART_RX_TOUT_THRHD_V) << (UART_RX_TOUT_THRHD_S))
#define UART_RX_TOUT_THRHD_V            0x7F
#define UART_RX_TOUT_THRHD_S            24

/* UART_RX_FLOW_EN : R/W ;bitpos:[23] ;default: 1'b0 ; */

/* Description: This is the flow enable bit for uart receiver. 1:choose
 * software flow control with configuring sw_rts signal
 */

#define UART_RX_FLOW_EN                 (BIT(23))
#define UART_RX_FLOW_EN_M               (BIT(23))
#define UART_RX_FLOW_EN_V               0x1
#define UART_RX_FLOW_EN_S               23

/* UART_RX_FLOW_THRHD : R/W ;bitpos:[22:16] ;default: 7'h0 ; */

/* Description: when receiver receives more data than its threshold value.
 * receiver produce signal to tell the transmitter stop transferring data.
 * the threshold value is (rx_flow_thrhd_h3 rx_flow_thrhd).
 */

#define UART_RX_FLOW_THRHD              0x0000007F
#define UART_RX_FLOW_THRHD_M            ((UART_RX_FLOW_THRHD_V) << (UART_RX_FLOW_THRHD_S))
#define UART_RX_FLOW_THRHD_V            0x7F
#define UART_RX_FLOW_THRHD_S            16

/* UART_TXFIFO_EMPTY_THRHD : R/W ;bitpos:[14:8] ;default: 7'h60 ; */

/* Description: when the data amount in transmitter fifo is less than its
 * threshold value. it will produce txfifo_empty_int_raw interrupt. the
 * threshold value is (tx_mem_empty_thrhd txfifo_empty_thrhd)
 */

#define UART_TXFIFO_EMPTY_THRHD         0x0000007F
#define UART_TXFIFO_EMPTY_THRHD_M       ((UART_TXFIFO_EMPTY_THRHD_V) << (UART_TXFIFO_EMPTY_THRHD_S))
#define UART_TXFIFO_EMPTY_THRHD_V       0x7F
#define UART_TXFIFO_EMPTY_THRHD_S       8

/* UART_RXFIFO_FULL_THRHD : R/W ;bitpos:[6:0] ;default: 7'h60 ; */

/* Description: When receiver receives more data than its threshold
 * value.receiver will produce rxfifo_full_int_raw interrupt.the threshold
 * value is (rx_flow_thrhd_h3 rxfifo_full_thrhd).
 */

#define UART_RXFIFO_FULL_THRHD          0x0000007F
#define UART_RXFIFO_FULL_THRHD_M        ((UART_RXFIFO_FULL_THRHD_V) << (UART_RXFIFO_FULL_THRHD_S))
#define UART_RXFIFO_FULL_THRHD_V        0x7F
#define UART_RXFIFO_FULL_THRHD_S        0

#define UART_LOWPULSE_OFFSET            0x28
#define UART_LOWPULSE_REG(i)            (REG_UART_BASE(i) + UART_LOWPULSE_OFFSET)

/* UART_LOWPULSE_MIN_CNT : RO ;bitpos:[19:0] ;default: 20'hFFFFF ; */

