apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uart.h
/* Description: This register stores the value of the minimum duration time
 * for the low level pulse. it is used in baudrate-detect process.
 */

#define UART_LOWPULSE_MIN_CNT           0x000FFFFF
#define UART_LOWPULSE_MIN_CNT_M         ((UART_LOWPULSE_MIN_CNT_V) << (UART_LOWPULSE_MIN_CNT_S))
#define UART_LOWPULSE_MIN_CNT_V         0xFFFFF
#define UART_LOWPULSE_MIN_CNT_S         0

#define UART_HIGHPULSE_OFFSET           0x2c
#define UART_HIGHPULSE_REG(i)           (REG_UART_BASE(i) + UART_HIGHPULSE_OFFSET)

/* UART_HIGHPULSE_MIN_CNT : RO ;bitpos:[19:0] ;default: 20'hFFFFF ; */

/* Description: This register stores  the value of the maximum duration time
 * for the high level pulse. it is used in baudrate-detect process.
 */

#define UART_HIGHPULSE_MIN_CNT          0x000FFFFF
#define UART_HIGHPULSE_MIN_CNT_M        ((UART_HIGHPULSE_MIN_CNT_V) << (UART_HIGHPULSE_MIN_CNT_S))
#define UART_HIGHPULSE_MIN_CNT_V        0xFFFFF
#define UART_HIGHPULSE_MIN_CNT_S        0

#define UART_RXD_CNT_OFFSET             0x30
#define UART_RXD_CNT_REG(i)             (REG_UART_BASE(i) + UART_RXD_CNT_OFFSET)

/* UART_RXD_EDGE_CNT : RO ;bitpos:[9:0] ;default: 10'h0 ; */

/* Description: This register stores the count of rxd edge change. it is
 * used in baudrate-detect process.
 */

#define UART_RXD_EDGE_CNT               0x000003FF
#define UART_RXD_EDGE_CNT_M             ((UART_RXD_EDGE_CNT_V) << (UART_RXD_EDGE_CNT_S))
#define UART_RXD_EDGE_CNT_V             0x3FF
#define UART_RXD_EDGE_CNT_S             0

#define UART_FLOW_CONF_OFFSET           0x34
#define UART_FLOW_CONF_REG(i)           (REG_UART_BASE(i) + UART_FLOW_CONF_OFFSET)

/* UART_SEND_XOFF : R/W ;bitpos:[5] ;default: 1'b0 ; */

/* Description: Set this bit to send xoff char. it is cleared by hardware
 * automatically.
 */

#define UART_SEND_XOFF                  (BIT(5))
#define UART_SEND_XOFF_M                (BIT(5))
#define UART_SEND_XOFF_V                0x1
#define UART_SEND_XOFF_S                5

/* UART_SEND_XON : R/W ;bitpos:[4] ;default: 1'b0 ; */

/* Description: Set this bit to send xon char. it is cleared by hardware
 * automatically.
 */

#define UART_SEND_XON                   (BIT(4))
#define UART_SEND_XON_M                 (BIT(4))
#define UART_SEND_XON_V                 0x1
#define UART_SEND_XON_S                 4

/* UART_FORCE_XOFF : R/W ;bitpos:[3] ;default: 1'b0 ; */

/* Description: Set this bit to set ctsn to enable the transmitter to go on
 * sending data.
 */

#define UART_FORCE_XOFF                 (BIT(3))
#define UART_FORCE_XOFF_M               (BIT(3))
#define UART_FORCE_XOFF_V               0x1
#define UART_FORCE_XOFF_S               3

/* UART_FORCE_XON : R/W ;bitpos:[2] ;default: 1'b0 ; */

/* Description: Set this bit to clear ctsn to stop the  transmitter from
 * sending data.
 */

#define UART_FORCE_XON                  (BIT(2))
#define UART_FORCE_XON_M                (BIT(2))
#define UART_FORCE_XON_V                0x1
#define UART_FORCE_XON_S                2

/* UART_XONOFF_DEL : R/W ;bitpos:[1] ;default: 1'b0 ; */

/* Description: Set this bit to remove flow control char from the received
 * data.
 */

#define UART_XONOFF_DEL                 (BIT(1))
#define UART_XONOFF_DEL_M               (BIT(1))
#define UART_XONOFF_DEL_V               0x1
#define UART_XONOFF_DEL_S               1

/* UART_SW_FLOW_CON_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */

/* Description: Set this bit to enable software  flow control. it is used
 * with register sw_xon or sw_xoff.
 */

#define UART_SW_FLOW_CON_EN             (BIT(0))
#define UART_SW_FLOW_CON_EN_M           (BIT(0))
#define UART_SW_FLOW_CON_EN_V           0x1
#define UART_SW_FLOW_CON_EN_S           0

#define UART_SLEEP_CONF_OFFSET          0x38
#define UART_SLEEP_CONF_REG(i)          (REG_UART_BASE(i) + UART_SLEEP_CONF_OFFSET)

/* UART_ACTIVE_THRESHOLD : R/W ;bitpos:[9:0] ;default: 10'hf0 ; */

/* Description: When the input rxd edge changes more than this register
 * value. the uart is active from light sleeping mode.
 */

#define UART_ACTIVE_THRESHOLD           0x000003FF
#define UART_ACTIVE_THRESHOLD_M         ((UART_ACTIVE_THRESHOLD_V) << (UART_ACTIVE_THRESHOLD_S))
#define UART_ACTIVE_THRESHOLD_V         0x3FF
#define UART_ACTIVE_THRESHOLD_S         0

#define UART_SWFC_CONF_OFFSET           0x3c
#define UART_SWFC_CONF_REG(i)           (REG_UART_BASE(i) + UART_SWFC_CONF_OFFSET)

/* UART_XOFF_CHAR : R/W ;bitpos:[31:24] ;default: 8'h13 ; */

/* Description: This register stores the xoff flow control char. */

#define UART_XOFF_CHAR                  0x000000FF
#define UART_XOFF_CHAR_M                ((UART_XOFF_CHAR_V) << (UART_XOFF_CHAR_S))
#define UART_XOFF_CHAR_V                0xFF
#define UART_XOFF_CHAR_S                24

/* UART_XON_CHAR : R/W ;bitpos:[23:16] ;default: 8'h11 ; */

/* Description: This register stores the xon flow control char. */

#define UART_XON_CHAR                   0x000000FF
#define UART_XON_CHAR_M                 ((UART_XON_CHAR_V) << (UART_XON_CHAR_S))
#define UART_XON_CHAR_V                 0xFF
#define UART_XON_CHAR_S                 16

/* UART_XOFF_THRESHOLD : R/W ;bitpos:[15:8] ;default: 8'he0 ; */

/* Description: When the data amount in receiver's fifo is less than this
 * register value. it will send a xon char with uart_sw_flow_con_en set to
 * 1.
 */

#define UART_XOFF_THRESHOLD             0x000000FF
#define UART_XOFF_THRESHOLD_M           ((UART_XOFF_THRESHOLD_V) << (UART_XOFF_THRESHOLD_S))
#define UART_XOFF_THRESHOLD_V           0xFF
#define UART_XOFF_THRESHOLD_S           8

/* UART_XON_THRESHOLD : R/W ;bitpos:[7:0] ;default: 8'h0 ; */

/* Description: when the data amount in receiver's fifo is more than this
 * register value. it will send a xoff char with uart_sw_flow_con_en set to
 * 1.
 */

#define UART_XON_THRESHOLD              0x000000FF
#define UART_XON_THRESHOLD_M            ((UART_XON_THRESHOLD_V) << (UART_XON_THRESHOLD_S))
#define UART_XON_THRESHOLD_V            0xFF
#define UART_XON_THRESHOLD_S            0

#define UART_IDLE_CONF_OFFSET           0x40
#define UART_IDLE_CONF_REG(i)           (REG_UART_BASE(i) + UART_IDLE_CONF_OFFSET)

