apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uart.h
/* UART_TX_BRK_NUM : R/W ;bitpos:[27:20] ;default: 8'ha ; */

/* Description: This register is used to configure the num of 0 send after
 * the process of sending data is done. it is active when txd_brk is set to
 * 1.
 */

#define UART_TX_BRK_NUM                 0x000000FF
#define UART_TX_BRK_NUM_M               ((UART_TX_BRK_NUM_V) << (UART_TX_BRK_NUM_S))
#define UART_TX_BRK_NUM_V               0xFF
#define UART_TX_BRK_NUM_S               20

/* UART_TX_IDLE_NUM : R/W ;bitpos:[19:10] ;default: 10'h100 ; */

/* Description: This register is used to configure the duration time
 * between transfers.
 */

#define UART_TX_IDLE_NUM                0x000003FF
#define UART_TX_IDLE_NUM_M              ((UART_TX_IDLE_NUM_V) << (UART_TX_IDLE_NUM_S))
#define UART_TX_IDLE_NUM_V              0x3FF
#define UART_TX_IDLE_NUM_S              10

/* UART_RX_IDLE_THRHD : R/W ;bitpos:[9:0] ;default: 10'h100 ; */

/* Description: when receiver takes more time than this register value to
 * receive a byte data. it will produce frame end signal for uhci to stop
 * receiving data.
 */

#define UART_RX_IDLE_THRHD              0x000003FF
#define UART_RX_IDLE_THRHD_M            ((UART_RX_IDLE_THRHD_V) << (UART_RX_IDLE_THRHD_S))
#define UART_RX_IDLE_THRHD_V            0x3FF
#define UART_RX_IDLE_THRHD_S            0

#define UART_RS485_CONF_OFFSET          0x44
#define UART_RS485_CONF_REG(i)          (REG_UART_BASE(i) + UART_RS485_CONF_OFFSET)

/* UART_RS485_TX_DLY_NUM : R/W ;bitpos:[9:6] ;default: 4'b0 ; */

/* Description: This register is used to delay the transmitter's internal
 * data signal.
 */

#define UART_RS485_TX_DLY_NUM           0x0000000F
#define UART_RS485_TX_DLY_NUM_M         ((UART_RS485_TX_DLY_NUM_V) << (UART_RS485_TX_DLY_NUM_S))
#define UART_RS485_TX_DLY_NUM_V         0xF
#define UART_RS485_TX_DLY_NUM_S         6

/* UART_RS485_RX_DLY_NUM : R/W ;bitpos:[5] ;default: 1'b0 ; */

/* Description: This register is used to delay the receiver's internal data
 * signal.
 */

#define UART_RS485_RX_DLY_NUM           (BIT(5))
#define UART_RS485_RX_DLY_NUM_M         (BIT(5))
#define UART_RS485_RX_DLY_NUM_V         0x1
#define UART_RS485_RX_DLY_NUM_S         5

/* UART_RS485RXBY_TX_EN : R/W ;bitpos:[4] ;default: 1'b0 ; */

/* Description: 1: enable rs485's transmitter to send data when rs485's
 * receiver is busy. 0:rs485's transmitter should not send data when its
 * receiver is busy.
 */

#define UART_RS485RXBY_TX_EN            (BIT(4))
#define UART_RS485RXBY_TX_EN_M          (BIT(4))
#define UART_RS485RXBY_TX_EN_V          0x1
#define UART_RS485RXBY_TX_EN_S          4

/* UART_RS485TX_RX_EN : R/W ;bitpos:[3] ;default: 1'b0 ; */

/* Description: Set this bit to enable loopback transmitter's output data
 * signal to receiver's input data signal.
 */

#define UART_RS485TX_RX_EN              (BIT(3))
#define UART_RS485TX_RX_EN_M            (BIT(3))
#define UART_RS485TX_RX_EN_V            0x1
#define UART_RS485TX_RX_EN_S            3

/* UART_DL1_EN : R/W ;bitpos:[2] ;default: 1'b0 ; */

/* Description: Set this bit to delay the stop bit by 1 bit. */

#define UART_DL1_EN                     (BIT(2))
#define UART_DL1_EN_M                   (BIT(2))
#define UART_DL1_EN_V                   0x1
#define UART_DL1_EN_S                   2

/* UART_DL0_EN : R/W ;bitpos:[1] ;default: 1'b0 ; */

/* Description: Set this bit to delay the stop bit by 1 bit. */

#define UART_DL0_EN                     (BIT(1))
#define UART_DL0_EN_M                   (BIT(1))
#define UART_DL0_EN_V                   0x1
#define UART_DL0_EN_S                   1

/* UART_RS485_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */

/* Description: Set this bit to choose rs485 mode. */

#define UART_RS485_EN                   (BIT(0))
#define UART_RS485_EN_M                 (BIT(0))
#define UART_RS485_EN_V                 0x1
#define UART_RS485_EN_S                 0

#define UART_AT_CMD_PRECNT_OFFSET       0x48
#define UART_AT_CMD_PRECNT_REG(i)       (REG_UART_BASE(i) + 0x48)

/* UART_PRE_IDLE_NUM : R/W ;bitpos:[23:0] ;default: 24'h186a00 ; */

/* Description: This register is used to configure the idle duration time
 * before the first at_cmd is received by receiver. when the duration
 * is less than this register value it will not take the next data received
 * as at_cmd char.
 */

#define UART_PRE_IDLE_NUM               0x00FFFFFF
#define UART_PRE_IDLE_NUM_M             ((UART_PRE_IDLE_NUM_V) << (UART_PRE_IDLE_NUM_S))
#define UART_PRE_IDLE_NUM_V             0xFFFFFF
#define UART_PRE_IDLE_NUM_S             0

#define UART_AT_CMD_POSTCNT_OFFSET      0x4c
#define UART_AT_CMD_POSTCNT_REG(i)      (REG_UART_BASE(i) + UART_AT_CMD_POSTCNT_OFFSET)

/* UART_POST_IDLE_NUM : R/W ;bitpos:[23:0] ;default: 24'h186a00 ; */

/* Description: This register is used to configure the duration time between
 * the last at_cmd and the next data. when the duration is less than this
 * register value  it will not take the previous data as at_cmd char.
 */

#define UART_POST_IDLE_NUM              0x00FFFFFF
#define UART_POST_IDLE_NUM_M            ((UART_POST_IDLE_NUM_V) << (UART_POST_IDLE_NUM_S))
#define UART_POST_IDLE_NUM_V            0xFFFFFF
#define UART_POST_IDLE_NUM_S            0

#define UART_AT_CMD_GAPTOUT_OFFSET      0x50
#define UART_AT_CMD_GAPTOUT_REG(i)      (REG_UART_BASE(i) + 0x50)

/* UART_RX_GAP_TOUT : R/W ;bitpos:[23:0] ;default: 24'h1e00 ; */

/* Description: This register is used to configure the duration time between
 * the at_cmd chars. when the duration time is less than this register
 * value it will not take the data as continuous at_cmd chars.
 */

#define UART_RX_GAP_TOUT                0x00FFFFFF
#define UART_RX_GAP_TOUT_M              ((UART_RX_GAP_TOUT_V) << (UART_RX_GAP_TOUT_S))
#define UART_RX_GAP_TOUT_V              0xFFFFFF
#define UART_RX_GAP_TOUT_S              0

#define UART_AT_CMD_CHAR_OFFSET         0x54
#define UART_AT_CMD_CHAR_REG(i)         (REG_UART_BASE(i) + UART_AT_CMD_CHAR_OFFSET)

/* UART_CHAR_NUM : R/W ;bitpos:[15:8] ;default: 8'h3 ; */

/* Description: This register is used to configure the num of continuous
 * at_cmd chars received by receiver.
 */

#define UART_CHAR_NUM                   0x000000FF
#define UART_CHAR_NUM_M                 ((UART_CHAR_NUM_V) << (UART_CHAR_NUM_S))
#define UART_CHAR_NUM_V                 0xFF
#define UART_CHAR_NUM_S                 8

/* UART_AT_CMD_CHAR : R/W ;bitpos:[7:0] ;default: 8'h2b ; */

