apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uart.h
/* Description: This register is used to configure the content of at_cmd
 * char.
 */

#define UART_AT_CMD_CHAR                0x000000FF
#define UART_AT_CMD_CHAR_M              ((UART_AT_CMD_CHAR_V) << (UART_AT_CMD_CHAR_S))
#define UART_AT_CMD_CHAR_V              0xFF
#define UART_AT_CMD_CHAR_S              0

#define UART_MEM_CONF_OFFSET            0x58
#define UART_MEM_CONF_REG(i)            (REG_UART_BASE(i) + UART_MEM_CONF_OFFSET)

/* UART_TX_MEM_EMPTY_THRHD : R/W ;bitpos:[30:28] ;default: 3'h0 ; */

/* Description: refer to txfifo_empty_thrhd 's description. */

#define UART_TX_MEM_EMPTY_THRHD         0x00000007
#define UART_TX_MEM_EMPTY_THRHD_M       ((UART_TX_MEM_EMPTY_THRHD_V) << (UART_TX_MEM_EMPTY_THRHD_S))
#define UART_TX_MEM_EMPTY_THRHD_V       0x7
#define UART_TX_MEM_EMPTY_THRHD_S       28

/* UART_RX_MEM_FULL_THRHD : R/W ;bitpos:[27:25] ;default: 3'h0 ; */

/* Description: refer to the rxfifo_full_thrhd's description. */

#define UART_RX_MEM_FULL_THRHD          0x00000007
#define UART_RX_MEM_FULL_THRHD_M        ((UART_RX_MEM_FULL_THRHD_V) << (UART_RX_MEM_FULL_THRHD_S))
#define UART_RX_MEM_FULL_THRHD_V        0x7
#define UART_RX_MEM_FULL_THRHD_S        25

/* UART_XOFF_THRESHOLD_H2 : R/W ;bitpos:[24:23] ;default: 2'h0 ; */

/* Description: refer to the uart_xoff_threshold's description. */

#define UART_XOFF_THRESHOLD_H2          0x00000003
#define UART_XOFF_THRESHOLD_H2_M        ((UART_XOFF_THRESHOLD_H2_V) << (UART_XOFF_THRESHOLD_H2_S))
#define UART_XOFF_THRESHOLD_H2_V        0x3
#define UART_XOFF_THRESHOLD_H2_S        23

/* UART_XON_THRESHOLD_H2 : R/W ;bitpos:[22:21] ;default: 2'h0 ; */

/* Description: refer to the uart_xon_threshold's description. */

#define UART_XON_THRESHOLD_H2           0x00000003
#define UART_XON_THRESHOLD_H2_M         ((UART_XON_THRESHOLD_H2_V) << (UART_XON_THRESHOLD_H2_S))
#define UART_XON_THRESHOLD_H2_V         0x3
#define UART_XON_THRESHOLD_H2_S         21

/* UART_RX_TOUT_THRHD_H3 : R/W ;bitpos:[20:18] ;default: 3'h0 ; */

/* Description: refer to the rx_tout_thrhd's description. */

#define UART_RX_TOUT_THRHD_H3           0x00000007
#define UART_RX_TOUT_THRHD_H3_M         ((UART_RX_TOUT_THRHD_H3_V) << (UART_RX_TOUT_THRHD_H3_S))
#define UART_RX_TOUT_THRHD_H3_V         0x7
#define UART_RX_TOUT_THRHD_H3_S         18

/* UART_RX_FLOW_THRHD_H3 : R/W ;bitpos:[17:15] ;default: 3'h0 ; */

/* Description: refer to the rx_flow_thrhd's description. */

#define UART_RX_FLOW_THRHD_H3           0x00000007
#define UART_RX_FLOW_THRHD_H3_M         ((UART_RX_FLOW_THRHD_H3_V) << (UART_RX_FLOW_THRHD_H3_S))
#define UART_RX_FLOW_THRHD_H3_V         0x7
#define UART_RX_FLOW_THRHD_H3_S         15

/* UART_TX_SIZE : R/W ;bitpos:[10:7] ;default: 4'h1 ; */

/* Description: This register is used to configure the amount of mem
 * allocated to transmitter's fifo.the default byte num is 128.
 */

#define UART_TX_SIZE                    0x0000000F
#define UART_TX_SIZE_M                  ((UART_TX_SIZE_V) << (UART_TX_SIZE_S))
#define UART_TX_SIZE_V                  0xF
#define UART_TX_SIZE_S                  7

/* UART_RX_SIZE : R/W ;bitpos:[6:3] ;default: 4'h1 ; */

/* Description: This register is used to configure the amount of mem
 * allocated to receiver's fifo. the default byte num is 128.
 */

#define UART_RX_SIZE                    0x0000000F
#define UART_RX_SIZE_M                  ((UART_RX_SIZE_V) << (UART_RX_SIZE_S))
#define UART_RX_SIZE_V                  0xF
#define UART_RX_SIZE_S                  3

/* UART_MEM_PD : R/W ;bitpos:[0] ;default: 1'b0 ; */

/* Description: Set this bit to power down mem.when reg_mem_pd registers in
 * the 3 uarts are all set to 1  mem will enter low power mode.
 */

#define UART_MEM_PD                     (BIT(0))
#define UART_MEM_PD_M                   (BIT(0))
#define UART_MEM_PD_V                   0x1
#define UART_MEM_PD_S                   0

#define UART_MEM_TX_STATUS_OFFSET       0x5c
#define UART_MEM_TX_STATUS_REG(i)       (REG_UART_BASE(i) + UART_MEM_TX_STATUS_OFFSET)

/* UART_MEM_TX_STATUS : RO ;bitpos:[23:0] ;default: 24'h0 ; */

/* Description: */

#define UART_MEM_TX_STATUS              0x00FFFFFF
#define UART_MEM_TX_STATUS_M            ((UART_MEM_TX_STATUS_V) << (UART_MEM_TX_STATUS_S))
#define UART_MEM_TX_STATUS_V            0xFFFFFF
#define UART_MEM_TX_STATUS_S            0

#define UART_MEM_RX_STATUS_OFFSET       0x60
#define UART_MEM_RX_STATUS_REG(i)       (REG_UART_BASE(i) + UART_MEM_RX_STATUS_OFFSET)

/* UART_MEM_RX_STATUS : RO ;bitpos:[23:0] ;default: 24'h0 ; */

/* Description: */

#define UART_MEM_RX_STATUS              0x00FFFFFF
#define UART_MEM_RX_STATUS_M            ((UART_MEM_RX_STATUS_V) << (UART_MEM_RX_STATUS_S))
#define UART_MEM_RX_STATUS_V            0xFFFFFF
#define UART_MEM_RX_STATUS_S            0

/* UART_RD_ADDRESS : bitpos:[12:2] */

/* Description: Read address of the UART RX FIFO. (a pointer) */

#define UART_RD_ADDRESS                 0x000007FF
#define UART_RD_ADDRESS_M               ((UART_RD_ADDRESS_V) << (UART_RD_ADDRESS_S))
#define UART_RD_ADDRESS_V               0x7FF
#define UART_RD_ADDRESS_S               2

/* UART_WR_ADDRESS : bitpos:[23:13] */

/* Description: Write address of the UART RX FIFO. (a pointer) */

#define UART_WR_ADDRESS                 0x000007FF
#define UART_WR_ADDRESS_M               ((UART_WR_ADDRESS_V) << (UART_WR_ADDRESS_S))
#define UART_WR_ADDRESS_V               0x7FF
#define UART_WR_ADDRESS_S               13

#define UART_MEM_CNT_STATUS_OFFSET      0x64
#define UART_MEM_CNT_STATUS_REG(i)      (REG_UART_BASE(i) + UART_MEM_CNT_STATUS_OFFSET)

/* UART_TX_MEM_CNT : RO ;bitpos:[5:3] ;default: 3'b0 ; */

/* Description: refer to the txfifo_cnt's description. */

#define UART_TX_MEM_CNT                 0x00000007
#define UART_TX_MEM_CNT_M               ((UART_TX_MEM_CNT_V) << (UART_TX_MEM_CNT_S))
#define UART_TX_MEM_CNT_V               0x7
#define UART_TX_MEM_CNT_S               3

/* UART_RX_MEM_CNT : RO ;bitpos:[2:0] ;default: 3'b0 ; */

/* Description: refer to the rxfifo_cnt's description. */

#define UART_RX_MEM_CNT                 0x00000007
#define UART_RX_MEM_CNT_M               ((UART_RX_MEM_CNT_V) << (UART_RX_MEM_CNT_S))
#define UART_RX_MEM_CNT_V               0x7
#define UART_RX_MEM_CNT_S               0

