apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_uart.h
#define UART_POSPULSE_OFFSET            0x68
#define UART_POSPULSE_REG(i)            (REG_UART_BASE(i) + 0x68)

/* UART_POSEDGE_MIN_CNT : RO ;bitpos:[19:0] ;default: 20'hFFFFF ; */

/* Description: This register stores the count of rxd posedge edge. it is
 * used in boudrate-detect process.
 */

#define UART_POSEDGE_MIN_CNT            0x000FFFFF
#define UART_POSEDGE_MIN_CNT_M          ((UART_POSEDGE_MIN_CNT_V) << (UART_POSEDGE_MIN_CNT_S))
#define UART_POSEDGE_MIN_CNT_V          0xFFFFF
#define UART_POSEDGE_MIN_CNT_S          0

#define UART_NEGPULSE_OFFSET            0x6c
#define UART_NEGPULSE_REG(i)            (REG_UART_BASE(i) + UART_NEGPULSE_OFFSET)

/* UART_NEGEDGE_MIN_CNT : RO ;bitpos:[19:0] ;default: 20'hFFFFF ; */

/* Description: This register stores the count of rxd negedge edge. it is
 * used in boudrate-detect process.
 */

#define UART_NEGEDGE_MIN_CNT            0x000FFFFF
#define UART_NEGEDGE_MIN_CNT_M          ((UART_NEGEDGE_MIN_CNT_V) << (UART_NEGEDGE_MIN_CNT_S))
#define UART_NEGEDGE_MIN_CNT_V          0xFFFFF
#define UART_NEGEDGE_MIN_CNT_S          0

#define UART_DATE_OFFSET                0x78
#define UART_DATE_REG(i)                (REG_UART_BASE(i) + 0x78)

/* UART_DATE : R/W ;bitpos:[31:0] ;default: 32'h15122500 ; */

/* Description: */

#define UART_DATE                       0xFFFFFFFF
#define UART_DATE_M                     ((UART_DATE_V) << (UART_DATE_S))
#define UART_DATE_V                     0xFFFFFFFF
#define UART_DATE_S                     0

#define UART_ID_OFFSET                  0x7c
#define UART_ID_REG(i)                  (REG_UART_BASE(i) + UART_ID_OFFSET)

/* UART_ID : R/W ;bitpos:[31:0] ;default: 32'h0500 ; */

/* Description: */

#define UART_ID                         0xFFFFFFFF
#define UART_ID_M                       ((UART_ID_V) << (UART_ID_S))
#define UART_ID_V                       0xFFFFFFFF
#define UART_ID_S                       0

#endif /* __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_UART_H */
